{
  "data": {
    "by": "xiange",
    "descendants": 86,
    "id": 44238171,
    "kids": [
      44245531,
      44240577,
      44238555,
      44238522,
      44238335,
      44238421,
      44241721,
      44241016,
      44238801,
      44244666,
      44242989,
      44240645,
      44238976,
      44241741,
      44241451,
      44240401,
      44239341,
      44239350,
      44240705,
      44240655,
      44240409,
      44241238,
      44239702,
      44238811,
      44239956,
      44240819,
      44242521,
      44239729,
      44238402,
      44239627
    ],
    "score": 299,
    "text": "I&#x27;m currently developing Chili3D, an open-source, browser-based 3D CAD application. By compiling OpenCascade to WebAssembly and integrating Three.js, Chili3D delivers near-native performance for powerful online modeling, editing, and rendering—all without local installation. Access it here:<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;xiangechen&#x2F;chili3d\">https:&#x2F;&#x2F;github.com&#x2F;xiangechen&#x2F;chili3d</a><p>Features:<p>Modeling Tools: Create basic shapes (boxes, cylinders, cones, etc.), 2D sketches (lines, arcs, circles, etc.), and perform advanced operations (boolean operations, extrusion, revolution, etc.).<p>Snapping and Tracking: Precisely snap to geometric features, workplanes, and track axes for accurate alignment.<p>Editing Tools: Modify (chamfer, fillet, trim, etc.), transform (move, rotate, mirror), and perform advanced edits (feature removal, sub-shape manipulation).<p>Measurement Tools: Measure angles and lengths, and calculate sums of length, area, and volume.<p>Document Management: Create, open, and save documents, with full undo&#x2F;redo history and support for importing&#x2F;exporting STEP, IGES, BREP formats.<p>User Interface: Office-style interface with contextual command organization, hierarchical assembly management, dynamic workplanes, and 3D viewport controls.<p>Multi-Language Support: Built-in i18n support with current languages including Chinese and English.",
    "time": 1749569997,
    "title": "Show HN: Chili3d – A open-source, browser-based 3D CAD application",
    "type": "story"
  },
  "created_at": 1749632424.356694,
  "expires_at": 1749636024.3566942
}