{
  "data": {
    "by": "piker",
    "descendants": 79,
    "id": 44256765,
    "kids": [
      44263342,
      44265764,
      44265766,
      44265463,
      44263963,
      44263923,
      44265690,
      44263624,
      44263029,
      44265562,
      44265306,
      44262790,
      44262950,
      44264939,
      44263965,
      44258870,
      44264302,
      44263156,
      44263632,
      44264552,
      44257340,
      44263363,
      44263987,
      44263010,
      44263008,
      44263635,
      44263375,
      44263269,
      44263907,
      44264780,
      44264401,
      44263817,
      44262976,
      44263494,
      44262927,
      44262915
    ],
    "score": 171,
    "text": "$1,500 an hour and still using the software my grandma used to make bingo fliers!?<p>Hi HN! I&#x27;d like to submit for your consideration Tritium (<a href=\"https:&#x2F;&#x2F;tritium.legal\" rel=\"nofollow\">https:&#x2F;&#x2F;tritium.legal</a>). Tritium aims to bring the power of the integrated development environment (IDE) to corporate lawyers.<p>My name is Drew Miller, and I&#x27;m lawyer admitted to the New York bar. I have spent the last 13 years in and out of corporate transactional practice, while building side projects in various languages using vanilla Vim. One day at work, I was asked to implement a legal technology product at my firm. Of course the only product available for editing and running programs in a locked-down environment was VS Code and its friends like Puppeteer from Microsoft.<p>I was really blown away at all of the capabilities of go-to definition and out-of-the box syntax highlighting as well as the debugger integration. I made the switch to a full IDE for my side projects immediately. And it hit me: why don&#x27;t we have this exact same tool in corporate law?<p>Corporate lawyers spent hours upon hours fumbling between various applications and instances of Word and Adobe. There are sub-par differencing products that make `patch` look like the future. They do this while charging you ridiculous rates.<p>I left my practice a few months later to build Tritium. Tritium aims to be the lawyer&#x27;s VS Code: an all-in-one drafting cockpit that treats a deal&#x27;s entire document suite as a single, searchable, AI-enhanced workspace while remaining fast, local, and secure.<p>Tritium is implemented in pure Rust. It is cross-platform and I&#x27;m excited for the prospect of lawyers running Linux as their daily driver. It leverages a modified version of the super fast egui.rs immediate-mode GUI library. The windows build includes a Rust COM implementation which was probably one of the more technical challenges other than laying out and rendering the text.<p>Download a copy at <a href=\"https:&#x2F;&#x2F;tritium.legal&#x2F;download\" rel=\"nofollow\">https:&#x2F;&#x2F;tritium.legal&#x2F;download</a> or try out a web-only WASM preview here: <a href=\"https:&#x2F;&#x2F;tritium.legal&#x2F;preview\" rel=\"nofollow\">https:&#x2F;&#x2F;tritium.legal&#x2F;preview</a><p>Let me know your thoughts! Your criticisms are the most important. Thank you for the time.",
    "time": 1749730019,
    "title": "Show HN: Tritium – The Legal IDE in Rust",
    "type": "story",
    "url": "https://tritium.legal/preview"
  },
  "created_at": 1749791403.3459547,
  "expires_at": 1749795003.3459547
}