{
  "data": {
    "by": "charleszyong",
    "descendants": 149,
    "id": 44240302,
    "kids": [
      44244417,
      44240853,
      44241233,
      44245252,
      44240818,
      44241738,
      44240475,
      44241312,
      44244501,
      44241446,
      44241754,
      44243809,
      44242171,
      44240764,
      44241722,
      44240729,
      44242501,
      44240617,
      44243457,
      44241651,
      44244331,
      44243521,
      44240814,
      44243380,
      44240723,
      44243305,
      44241799,
      44242080,
      44244104,
      44242239,
      44241074,
      44241505,
      44242345,
      44243385,
      44241291,
      44240932,
      44243085,
      44242563,
      44240904,
      44241489,
      44241186,
      44242905,
      44241571,
      44240726,
      44240610,
      44240779,
      44240971,
      44241984,
      44240804,
      44241672,
      44241795,
      44241272,
      44241830,
      44240515,
      44240480,
      44241510,
      44244007,
      44243895,
      44243839,
      44240584,
      44243182,
      44240634,
      44243179,
      44243383,
      44242465,
      44240507,
      44241011,
      44240455
    ],
    "score": 424,
    "text": "Hi HN — I’m Charles from Vassar Robotics (<a href=\"https:&#x2F;&#x2F;vassarrobotics.com&#x2F;\">https:&#x2F;&#x2F;vassarrobotics.com&#x2F;</a> - not much there but you can order the robot at <a href=\"https:&#x2F;&#x2F;shop.vassarrobotics.com&#x2F;products&#x2F;navrim-robot-that-learns-skills-in-30-minutes\">https:&#x2F;&#x2F;shop.vassarrobotics.com&#x2F;products&#x2F;navrim-robot-that-l...</a>)<p>Edit: the entire run sold out thanks to HN today—thank you all! And sorry to anyone who missed out. You can get in on the next batch here: <a href=\"https:&#x2F;&#x2F;vassarrobotics.com&#x2F;newsletter\">https:&#x2F;&#x2F;vassarrobotics.com&#x2F;newsletter</a>.<p>We are bringing an upgraded version of the long beloved SO-101 robot arms to a $219 price point with improved mechanical design and added intelligence. See what it can do here: <a href=\"https:&#x2F;&#x2F;youtube.com&#x2F;shorts&#x2F;xNyPKJZI400\" rel=\"nofollow\">https:&#x2F;&#x2F;youtube.com&#x2F;shorts&#x2F;xNyPKJZI400</a> (demos are sped up as shown in the video)<p>I’ve spent a few years building RC planes (<a href=\"https:&#x2F;&#x2F;cyo.ng&#x2F;hangar&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;cyo.ng&#x2F;hangar&#x2F;</a>) and micro gas turbines (<a href=\"https:&#x2F;&#x2F;set.mit.edu\" rel=\"nofollow\">https:&#x2F;&#x2F;set.mit.edu</a>), and I’ve always wished hardware were cheaper so more people could experiment.<p>I’m now launching a $219 desktop robot-arm kit that keeps LeRobot SO-101’s kinematics, swaps key parts for sturdier, more precise SLA prints, and adds two integrated 480 p cameras. After plenty of supplier haggling, the whole kit costs less than the twelve servos alone. I’ll release the updated mechanical design under an MIT license by June 30.<p>On the software side, I&#x27;ll also release an MIT-licensed MCP server by June 30 that exposes the local robot policy as tools for agentic LLMs (Opus 4, o3, etc.) to use in long-horizon tasks. Here&#x27;s how it works: You can teach the robot new skills through teleoperation. During inference, you simply talk to the agentic LLM using natural language instructions. The LLM then calls the local robot policy through MCP, automatically decomposing your high-level requests into executable robot commands.<p>Thanks to the LeRobot community for making such an amazing robot accessible. If you’ve contributed to the LeRobot GitHub repo, email hello@vassarrobotics.com for a 20% discount coupon as a small thank-you.<p>I’d love your feedback! Beyond manufacturing, cleaning up the codebase, and writing docs, I’m considering: a force-controlled gripper, a parallel-jaw gripper, an extra wrist DOF (matching the new Trossen and ARX arms), full force feedback on the leader arm (though that may triple the price), a more affordable version with lower resolution each joint, and a longer-reach variant. Which of these—or something else—would be most useful to you?<p>You can order it here if you want: <a href=\"https:&#x2F;&#x2F;shop.vassarrobotics.com&#x2F;products&#x2F;navrim-robot-that-learns-skills-in-30-minutes\">https:&#x2F;&#x2F;shop.vassarrobotics.com&#x2F;products&#x2F;navrim-robot-that-l...</a>. (Edit: sold out! You can get in on the next batch here: <a href=\"https:&#x2F;&#x2F;vassarrobotics.com&#x2F;newsletter\">https:&#x2F;&#x2F;vassarrobotics.com&#x2F;newsletter</a>. I hope we can have your business in the future.)<p>Looking forward to any and all comments!<p>---<p>Edit: A quick explanation regarding shipping times (as stated on our shop page):<p>• The first batch of 20 units, which will be shipped by June 30, is sold out.<p>• The second batch of 100 units will be shipped by July 15 (unassembled kits) and July 21 (assembled units). The order limit is to ensure we can ship on time and maintain high quality.<p>For those who have already placed orders: I will reach out individually to ask if you would like to receive weekly progress updates from now until the shipping date.",
    "time": 1749582737,
    "title": "Launch HN: Vassar Robotics (YC X25) – $219 robot arm that learns new skills",
    "type": "story"
  },
  "created_at": 1749633338.070944,
  "expires_at": 1749636938.0709443
}